tap "d12frosted/emacs-plus"

brew "awscli"
brew "bash-language-server"
brew "btop"
brew "curl"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "graphviz"
brew "imagemagick"
brew "jless"
brew "jq"
brew "libgccjit"
brew "make"
brew "mas"
brew "openssl"
brew "pandoc"
brew "ripgrep"
brew "starship"
brew "terraform"
brew "terraform-ls"
brew "tree"
brew "vim"

brew "d12frosted/emacs-plus/emacs-plus", args: ["with-imagemagick", "with-modern-doom-icon", "with-native-comp", "with-poll"]

cask "amethyst"
cask "iterm2"
cask "linear-linear"
cask "macfuse"
cask "monodraw"
cask "notion"
cask "obsidian"
cask "slack"
cask "spotify"
cask "ticktick"
cask "visual-studio-code"
cask "zoom"

mas "amphetamine", id: 937984704

# vim: set ft=ruby :
