tap "d12frosted/emacs-plus"
tap "oven-sh/bun"
tap "riscv/riscv"

brew "awscli"
brew "bash-language-server"
brew "btop"
brew "buf"
brew "curl"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "flyctl"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "graphviz"
brew "grip"
brew "hyperfine"
brew "imagemagick"
brew "jless"
brew "jq"
brew "libgccjit"
brew "make"
brew "mas"
brew "node"
brew "openssl"
brew "pandoc"
brew "protoc-gen-go"
brew "qemu"
brew "ripgrep"
brew "riscv-tools"
brew "rustup"
brew "starship"
brew "terraform"
brew "terraform-ls"
brew "typescript-language-server"
brew "tree"
brew "vercel-cli"
brew "vim"
brew "zig"
brew "zls"

brew "d12frosted/emacs-plus/emacs-plus", args: ["with-imagemagick", "with-modern-doom-icon", "with-native-comp", "with-poll"]
brew "oven-sh/bun/bun"

cask "amethyst"
cask "clion"
cask "drawio"
cask "elgato-control-center"
cask "google-chrome"
cask "iterm2"
cask "linear-linear"
cask "loom"
cask "macfuse"
cask "monodraw"
cask "notion"
cask "obsidian"
cask "raycast"
cask "rustrover"
cask "slack"
cask "spotify"
cask "ticktick"
cask "visual-studio-code"
cask "zoom"

mas "amphetamine", id: 937984704
mas "xcode", id: 497799835
mas "okta-extension-app", id: 1439967473

# vim: set ft=ruby :
